// 周几、第几节课(2节合为1节，特殊情况届时会特殊处理)、期望颜色(与总表对应)、科目、上课地点、授课教师。
l("1", "1", "a", "微信公众平台开发", "东校区 东 3#418 移动互联实训室", "周军强");
l("1", "2", "b", "Java 程序设计", "东校区 东 3#418 移动互联实训室", "陈磊");
l("1", "3", "c", "机器学习", "东校区 东 3#426 大数据实训室", "陶剑文");
l("2", "1", "d", "数据采集与处理", "东校区 东 3#426 大数据实训室", "但雨芳");
l("2", "2", "e", "大数据基础", "东校区 东 3#426 大数据实训室", "何颂颂");
l("2", "3", "f", "计算机网络基础", "东校区 东 3#411 系统集成实训室", "竺士蒙");
l("3", "3", "g", "数据可视化", "东校区 东 3#426 大数据实训室", "何颂颂");
l("4", "2", "b", "Java 程序设计", "东校区 东 3#418 移动互联实训室", "陈磊");
l("4", "3-2", "h", "大数据工作坊活动", "东校区 东 3#122 大数据 & 人工智能工作坊", "（不定）");
l("4", "5", "c", "机器学习", "东校区 东 3#426 大数据实训室", "陶剑文");
l("5", "1", "d", "数据采集与处理", "东校区 东 3#426 大数据实训室", "但雨芳");
l("5", "2", "e", "大数据基础", "东校区 东 3#426 大数据实训室", "何颂颂");

function l(c, t, n, clsname, intext, tech) {
    var id = "info" + c + t,
        clsid = "info " + n;
    var elm = document.getElementById(id);
    if (t == "1") {
        var time = "08:30-09:55";
    } else if (t == "2") {
        var time = "10:05-11:30";
    } else if (t == "3") {
        var time = "13:30-14:55";
    } else if (t == "3-2") {
        var time = "13:30-16:35（结束时间视具体情况而定）";
    } else if (t == "4") {
        var time = "15:05-16:35";
    } else if (t == "5") {
        var time = "18:20-19:45";
    } else {
        var time = "~";
    };
    elm.innerHTML = "<div class='maininfo'>" + clsname + '</div>' +
        "<div class='intext'>时间：" + time + "</div>" +
        "<div class='intext'>上课地点：" + intext + "</div>" +
        "<div class='intext'>任课教师：" + tech + "</div>";
    elm.className = clsid;
    elm.style.color = "#fff";
    elm.style.display = "block"
};